aoc2018.org
:setup:
#+HUGO_BASE_DIR: .
#+HUGO_SECTION: post
#+todo: todo | edit finished
#+PROPERTY: header-args :exports code :results output
:end:
#+title:  Advent of Code 2018
#+author: Piotr Kaznowski
#+date:   2020-01-03

* edit Day 02: Inventory Management System :comp:frequencies:vals_keys:for_loop:
CLOSED: [2020-01-11 Sat 10:55]
:PROPERTIES:
:EXPORT_FILE_NAME: day02
:EXPORT_HUGO_WEIGHT: 102
:EXPORT_HUGO_CUSTOM_FRONT_MATTER+: :summary "Frequencies, sets and list comprehension (for loop)"
:END:
** Puzzle summary
https://adventofcode.com/2018/day/2

As input we get list of strings made of random letters representing IDs of boxes. The task is to find "checksum" of strings which contain some letters twice multiplied by count of strings which contain triple letters. 

** Descriptions               :noexport:
*** Part 1
You stop falling through time, catch your breath, and check the screen on the device. "Destination reached. Current Year: 1518. Current Location: North Pole Utility Closet 83N10." You made it! Now, to find those anomalies.

Outside the utility closet, you hear footsteps and a voice. "...I'm not sure either. But now that so many people have chimneys, maybe he could sneak in that way?" Another voice responds, "Actually, we've been working on a new kind of suit that would let him fit through tight spaces like that. But, I heard that a few days ago, they lost the prototype fabric, the design plans, everything! Nobody on the team can even seem to remember important details of the project!"

"Wouldn't they have had enough fabric to fill several boxes in the warehouse? They'd be stored together, so the box IDs should be similar. Too bad it would take forever to search the warehouse for two similar box IDs..." They walk too far away to hear any more.

Late at night, you sneak to the warehouse - who knows what kinds of paradoxes you could cause if you were discovered - and use your fancy wrist device to quickly scan every box and produce a list of the likely candidates (your puzzle input).

To make sure you didn't miss any, you scan the likely candidate boxes again, counting the number that have an ID containing exactly two of any letter and then separately counting those with exactly three of any letter. You can multiply those two counts together to get a rudimentary checksum and compare it to what your device predicts.

For example, if you see the following box IDs:

#+begin_example
abcdef contains no letters that appear exactly two or three times.
bababc contains two a and three b, so it counts for both.
abbcde contains two b, but no letter appears exactly three times.
abcccd contains three c, but no letter appears exactly two times.
aabcdd contains two a and two d, but it only counts once.
abcdee contains two e.
ababab contains three a and three b, but it only counts once.
#+end_example

#+begin_src txt :tangle inputs/day02-ex1
  abcdef
  bababc
  abbcde
  abcccd
  aabcdd
  abcdee
  ababab
#+end_src

Of these box IDs, four of them contain a letter which appears exactly twice, and three of them contain a letter which appears exactly three times. Multiplying these together produces a checksum of 4 * 3 = 12.

What is the checksum for your list of box IDs?

*** Part 2
Confident that your list of box IDs is complete, you're ready to find the boxes full of prototype fabric.

The boxes will have IDs which differ by exactly one character at the same position in both strings. For example, given the following box IDs:

#+begin_src txt :tangle inputs/day02-ex2
abcde
fghij
klmno
pqrst
fguij
axcye
wvxyz
#+end_src

The IDs abcde and axcye are close, but they differ by two characters (the second and fourth). However, the IDs fghij and fguij differ by exactly one character, the third (h and u). Those must be the correct boxes.

What letters are common between the two correct box IDs? (In the example above, this is found by removing the differing character from either ID, producing fgij.)

** Solution
[[https://gitlab.com/pkaznowski/aoc18/blob/master/src/aoc18/puzzle02.clj][Check full solution in the repo]]

*** Namespace and requirements
This time I'll explore some ~set~ and ~string~ funcs. (I add ~:rename~ keyword because Clojure complains about renaming ~replace~ from ~clojure.core~ by the func of same name from ~clojure.string.~)

#+name: day02_ns
#+begin_src clojure :noweb-ref code02 :exports code
  (ns aoc18.puzzle02
    (:require [aoc18.utils :refer [input->str]]
              [clojure.set :as set :refer [difference]]
              [clojure.string :as string :refer [replace join] :rename {replace rpl}]
              [clojure.repl :refer [doc]]))

#+end_src

#+begin_src clojure :noweb-ref test02 :exports none
  (ns aoc18.puzzle02-test
    (:require [aoc18.utils :refer [input->str]]
              [aoc18.puzzle02 :refer :all]
              [clojure.test :refer :all]))

#+end_src

*** Helper: count letter repetitions
First let's count what are letter repetition ratios in given strings. If a string has no repeated letters our func should return a ~set~ containing 1 which indicates that all letters are used only once. If there are letters repeaded once, set should contain 2 as well, etc.:

#+name: day03_letter_repetition_test
#+begin_src clojure :noweb-ref test02
(deftest letter-repetition-test
  (testing "should return set of letter frequencies"
    (is (= #{1} (letter-repetition "abcdef")))
    (is (= #{1 2} (letter-repetition "abcabe")))
    (is (= #{1 2 3} (letter-repetition "abcabea")))))

#+end_src 

#+name: day02_letter_repetition
#+begin_src clojure :noweb-ref code02
  (defn letter-repetition [word] ((comp set vals frequencies) word))

#+end_src

Let's break it down.

~comp~ enables making "composite" funcs instead of writing nested calls. For example:

#+name: day02_comp_example
#+begin_src clojure :exports code :results silent
  (assert (= (set (vals (frequencies "noob")))      ;; => #{1 2}
             ((comp set vals frequencies) "noob"))) ;; => #{1 2}
#+end_src

Next, ~frequencies~:

#+name: day02_frequencies_doc
#+begin_src clojure :exports results
(doc frequencies)
#+end_src

#+RESULTS: day02_frequencies_doc
: -------------------------
: clojure.core/frequencies
: ([coll])
:   Returns a map from distinct items in coll to the number of times
:   they appear.

For example:

#+name: day02_frequencies_example
#+begin_src clojure :exports code :results code
  (frequencies "noob")     ;; => {\n 1, \o 2, \b 1}
#+end_src

~vals~, as expected, would give seq of map's values (as opposite to ~keys~):

#+name: day02_vals_example
#+begin_src clojure :exports code :results silent
  (vals {\n 1, \o 2, \b 1})  ;; => (1 2 1)
  (keys {\n 1, \o 2, \b 1})  ;; => (\n \o \b)
#+end_src

And finally ~set~ "returns a set of the distinct elements of coll".

*** Helper: doubles and triples
Since we are interested only in occurences of doubles and triples we may represent each string as a two-element ~vector~ where index 0 indicates doubles (0 if none, 1 if any) and index 1 indicates triples: 

#+name: day02_two_threes_test
#+begin_src clojure :noweb-ref test02
(deftest two-threes-test
  (testing "should return vecor of ones and zeros, where indx 0 indicates if there are
            doubled letters, and idx 1 -- tripled letters"
    (is (= [0 0] (two-threes #{1})))
    (is (= [0 1] (two-threes #{1 3})))
    (is (= [1 0] (two-threes #{2 4})))
    (is (= [1 1] (two-threes #{1 2 3 4})))))

#+end_src

At first I wrote this using combined ~if~ statements put into ~[]~ but why not repeat oneself and use ~map~ for fun:

#+name: day02_two_threes
#+begin_src clojure :noweb-ref code02
  (defn two-threes [freqs] (vec (map #(if (freqs %) 1 0) [2 3])))

#+end_src

*** Count checksum (part 1)
Now we are ready to get checksum of all words. I will convert all words to vectors indicating doubles and triples, than multiply the sum of all doubles by the sum of all triples:

#+name: day02_checksum
#+begin_src clojure :noweb-ref code02
  (defn checksum [words]
    (->> words
         (map (fn [w] (two-threes (letter-repetition w))))
         (apply map +)
         (apply *)))

#+end_src

Let's check if it matches exemplary data:

#+name: day02_checksum_test
#+begin_src clojure :noweb-ref test02
  (deftest checksum-test
    (testing "should match puzzle 1 example"
      (is (= 12 (checksum (input->str "day02-ex1"))))))

#+end_src

*** Helper: compare letters
Since we have to find common letters in two words which differ exactly by one letter, first we need to find those two similar words.

For given two words I will convert them into sequences and ~map~ them checking if corresponding letters are equal. This will result in a seq of booleans. Feeding it to ~frequencies~ will result in a two-element map where boolenas are keys and their occurences are values. E.g. ~{false 1 true 3}~ means that in two words three letters are the same, but one letter in each word is not matched in another.

#+name: day02_part2
#+begin_src clojure :noweb-ref code02
  (defn compare-letters [w1 w2] (frequencies (map = (seq w1) (seq w2))))

#+end_src

Let's see the code in action:

#+name: day02_compare_letters_test
#+begin_src clojure :noweb-ref test02
(deftest compare-letters-test
  (testing "should return hashmap where keys are booleans and values are number of common
            letters, e.g. {true 3, false 1} means that there are three letters doubled 
            and one is not common"
    (is (= {false 4} (compare-letters "asdf" "qwer")))
    (is (= {true 3 false 1} (compare-letters "asdf" "asdq")))
    (is (= {true 2 false 2} (compare-letters "asdf" "askl")))))

#+end_src

*** Find similar words
To find two similar words in a collection I will use ~for~ loop using it's goodies of ~:let~ and ~:when~. In fact it will act as a nested loop because for each word it will filter the whole collection looking for similar word (the ~let~ part) and if (or rather: ~when~) theres a match it will return seq containing similar words. Since I know there will be only one pair it is safe to return the first element of the seq which is returned be the loop. I know it's not the most optimal solution, but for the sake of exploring new forms I'll stick with that for now.

*TODO*: make combinations of all words and using ~loop~ (which enables a "break" behavior) find two similar words.

#+name: day02_find_similar
#+begin_src clojure :noweb-ref code02
  (defn find-similar [words]
    (first
     (for [w1 words
           :let [m (filter (fn [w2] (= ((compare-letters w1 w2) false) 1)) words)]
           :when (seq m)]
       (conj m w1))))

#+end_src

Let's check how it works:
#+name: day02_find_similar_test
#+begin_src clojure :noweb-ref test02
  (deftest find-similar-test
    (testing "should return list of two words that differ only by one letter"
      (is (= '("fghij" "fguij") (find-similar (input->str "day02-ex2"))))))

#+end_src

*** Get common string (part 2)
When we have two similar words found, getting common string may be accomplished by comparing two strings converted to ~sets~ of letters and replacing the letter which they differ by by an empty string. Or is it an overkill?

#+name: day02_common_str
#+begin_src clojure :noweb-ref code02
  (defn common-str [pair]
    (string/replace (first pair)
                 ((comp re-pattern str first)
                  (->> pair
                       (map set)
                       (apply set/difference)))
                 ""))

#+end_src

Second attempt: without using sets -- joining mapping of two words converted into sequencies in terms of identity of letters:

#+name: day02_common_str2
#+begin_src clojure :noweb-ref code02
  (defn common-str2 [[w1 w2]]
    (string/join (map (fn [l1 l2] (if (= l1 l2) l1)) (seq w1) (seq w2))))

#+end_src
  
Now check if they are compatible:

#+name: day02_common_str_test
#+begin_src clojure :noweb-ref test02
  (deftest example2-test
    (testing "should match puzzle2 example"
      (let [words (find-similar (input->str "day02-ex2"))]
        (is (= "fgij" (time (common-str words))))
        (is (= "fgij" (time (common-str2 words)))))))

  ;; the test above is tricky because all letters are already sorted alphabetically
  ;; we need to test words which have random order of letters

  (deftest common-str-test
    (testing "should return the same string"
      (let [words '("waxyhi" "wexyhi")]
        (is (= "wxyhi" (time (common-str words))))
        (is (= "wxyhi" (time (common-str2 words)))))))

#+end_src

*** Putting things together
#+name: day02_solve
#+begin_src clojure :noweb-ref code02
  (defn solve []
    (let [inp (input->str "day02")
          words (find-similar inp)]
      {:part1 (time (checksum inp))
       :part2-1 (time (common-str words))
       :part2-2 (time (common-str2 words))}))

#+end_src

Run tests:

#+name: day02_tangle
#+begin_src clojure :noweb yes :tangle test/aoc18/puzzle02_test.clj :exports none
  <<test02>>
#+end_src

#+name: day02_tests
#+begin_src clojure :results output :exports results
  (require '[clojure.test :refer [run-tests]] 'aoc18.puzzle02-test)
  (run-tests 'aoc18.puzzle02-test)
#+end_src

#+RESULTS: day02_tests
: 
: Testing aoc18.puzzle02-test
: "Elapsed time: 0.042699 msecs"
: "Elapsed time: 0.016143 msecs"
: "Elapsed time: 0.028304 msecs"
: "Elapsed time: 0.011218 msecs"
: 
: Ran 7 tests containing 16 assertions.
: 0 failures, 0 errors.

Get the answer:

#+name: day02_tangle
#+begin_src clojure :noweb yes :tangle src/aoc18/puzzle02.clj :exports none
  <<code02>>
#+end_src

#+RESULTS: day02_tangle

#+name: day02_results
#+begin_src clojure :exports results :ns aoc18.puzzle02 :results code
  (solve)
#+end_src

#+RESULTS: day02_results
#+begin_src clojure
"Elapsed time: 30.376229 msecs"
"Elapsed time: 0.323308 msecs"
"Elapsed time: 0.429427 msecs"
{:part1 5456,
 :part2-1 "megsdlpulxvinkatfoyzxcbvq",
 :part2-2 "megsdlpulxvinkatfoyzxcbvq"}
#+end_src

** COMMENT Commentary
New stuff [0/6] 
- [ ] comp
- [ ] frequencies
- [ ] vals/keys
- [ ] for loop
- [ ] apply map +
- [ ] tests: some? seq empty? etc
- [ ] about order in sequences

